In [21]:
import pandas as pd
import numpy as np

In [60]:
df=pd.read_excel("C://Users//shani//Desktop//Data Science//Notebooks//DATA SET//mca.xlsx")

In [28]:
df.head()

   reg no   Name adbms  aos    ai  acn
0    1011    awd    23  NaN  42.0   23
1    1012    era    34   35  56.0   23
2    1013   asfa    na  NaN  37.0   ab
3    1014   safs    45   na   NaN   32
4    1015  sdvds   NaN  NaN  34.0  NaN

In [27]:
rows,cols=df.shape
print("rows=",rows,'cols=',cols)

rows= 7 cols= 6

In [30]:
df.dtypes

reg no      int64
Name       object
adbms      object
aos        object
ai        float64
acn        object
dtype: object

In [31]:
df[3:6]

   reg no   Name adbms  aos    ai  acn
3    1014   safs    45   na   NaN   32
4    1015  sdvds   NaN  NaN  34.0  NaN
5    1016    vds    45   34  42.0   28

In [33]:
df[['adbms','aos','ai']].head()

  adbms  aos    ai
0    23  NaN  42.0
1    34   35  56.0
2    na  NaN  37.0
3    45   na   NaN
4   NaN  NaN  34.0

In [39]:
df[df['ai']>42]

   reg no   Name adbms aos    ai acn
1    1012    era    34  35  56.0  23
6    1017  dsvxs    27  38  56.0  36

In [44]:
df.set_index('reg no',inplace=True)

In [45]:
df

         Name adbms  aos    ai  acn
reg no
1011      awd    23  NaN  42.0   23
1012      era    34   35  56.0   23
1013     asfa    na  NaN  37.0   ab
1014     safs    45   na   NaN   32
1015    sdvds   NaN  NaN  34.0  NaN
1016      vds    45   34  42.0   28
1017    dsvxs    27   38  56.0   36

In [46]:
df.reset_index(inplace=True)

In [47]:
df

   reg no   Name adbms  aos    ai  acn
0    1011    awd    23  NaN  42.0   23
1    1012    era    34   35  56.0   23
2    1013   asfa    na  NaN  37.0   ab
3    1014   safs    45   na   NaN   32
4    1015  sdvds   NaN  NaN  34.0  NaN
5    1016    vds    45   34  42.0   28
6    1017  dsvxs    27   38  56.0   36

In [54]:
df[df['ai']==df['ai'].max()]

   reg no   Name adbms aos    ai acn
1    1012    era    34  35  56.0  23
6    1017  dsvxs    27  38  56.0  36

In [62]:
df.describe()

            reg no         ai
count     7.000000   6.000000
mean   1014.000000  44.500000
std       2.160247   9.418068
min    1011.000000  34.000000
25%    1012.500000  38.250000
50%    1014.000000  42.000000
75%    1015.500000  52.500000
max    1017.000000  56.000000

In [63]:
df[df.ai<42]

   reg no   Name adbms  aos    ai  acn
2    1013   asfa    na  NaN  37.0   ab
4    1015  sdvds   NaN  NaN  34.0  NaN

In [72]:
df[['reg no','Name']][df.ai==df.ai.max()]

   reg no   Name
1    1012    era
6    1017  dsvxs

In [74]:
df.columns

Index(['reg no', 'Name', 'adbms', 'aos', 'ai', 'acn'], dtype='object')

In [75]:
df['ai'].std()

9.418067742376884

In [77]:
df['ai'].mean()

44.5

In [78]:
df['ai'].mode()

0    42.0
1    56.0
Name: ai, dtype: float64

In [79]:
df['ai'].median()

42.0

In [81]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [ ]:
df.set_index('reg no')